load-test-cloud.yaml
# This an example Artillery load test that includes:
# - A load configuration with 3 distinct phases that create
#   a burst of traffic after a warm up period
# - How to use built-in "apdex" and "ensure" plugins to set up
#   automated scoring and checking of performance results from the test
# - Using metrics-by-endpoint plugin to enable reporting of metrics
#   for each individual URL in the test
config:
  # This is a test server run by team Artillery
  # It's designed to be highly scalable and withstand
  # traffic spikes of millions of requests per second
  target: https://spring-cloud-app-ltjy3.ondigitalocean.app
  phases:
    - duration: 60
      arrivalRate: 1
      rampTo: 5
      name: Warm up phase
    - duration: 60
      arrivalRate: 5
      rampTo: 10
      name: Ramp up load
    - duration: 30
      arrivalRate: 10
      rampTo: 30
      name: Spike phase
  # Load a couple of useful plugins
  # https://docs.art/reference/extensions
  plugins:
    ensure: {}
    apdex: {}
    metrics-by-endpoint: {}
  # Set a threshold of 200ms for calculating Apdex scores
  # https://docs.art/reference/extensions/apdex
  apdex:
    threshold: 200
  # Configure automated checks
  # https://docs.art/reference/extensions/ensure
  ensure:
    thresholds:
      - http.response_time.p99: 250
      - http.response_time.p95: 300
  http:
    cookieJarOptions:
      rejectPublicSuffixes: false
scenarios:
  - flow:
      - loop:
          - get:
              url: "/visits"
          - post:
              url: "/visits"
              json:
                name: "Dado"
          - think: 1
        count: 10